cask_args appdir: "/Applications"

# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'mas-cli/tap', pin: true

# Binaries
brew 'bat'
brew 'coreutils'
brew 'git'
brew 'grep'
brew 'mas'
brew 'trash'
brew 'jenv'
brew 'pyenv'
brew 'zplug'
brew 'zsh'
brew 'rbenv'
brew 'htop'
brew 'speedtest-cli'
brew 'tldr'
brew 'archey'
brew 'mycli'

# Apps
cask 'aerial'
cask 'google-chrome'
cask 'adoptopenjdk'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'docker'
cask 'jetbrains-toolbox'
cask 'iterm2'
cask 'visual-studio-code'
cask 'clipy'
cask 'spectacle'
cask 'notion'
cask 'gas-mask'
cask 'caffeine'
cask 'emacs'
cask 'tunnelblick'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Kindle', id: 405399194
mas 'Slack', id: 803453959 
mas 'Alfred', id: 405843582 
mas 'Xcode', id: 497799835
